{
  "name": "Danny To",
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_danny",
  "summary": "I am a new Computer Science graduate and have been working with Jarvis Consulting. I obtained my Bachelor of Science from University of Ontario Institute of Technology, and worked a brief internship with Tyco International. As a new graduate, software and data engineering seems like the perfect intersection of everything we were taught to appreciate - technical challenges that are best solved with an analytical approach. Of course, there is also the excitement of being able to work with emerging technologies in a thriving industry.",
  "skills": {
    "proficient": [
      "Java/Springboot",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Algorithms/Data Structures",
      "Docker",
      "REST APIs"
    ],
    "competent": [
      "Python",
      "Data Analytics (Zeppelin, Jupyter)",
      "OOP",
      "JUnit",
      "HTML/CSS"
    ],
    "familiar": [
      "C++",
      "Javascript",
      "Perforce",
      "Google Cloud Platform",
      "Jenkins"
    ]
  },
  "jarvis_projects": [
    {
      "name": "Cluster Monitor",
      "git_url": "/linux_sql",
      "description": "Developed a monitoring agent to obtain hardware usage stats across a cluster of nodes. All data is automatically pulled by a bash script and inserted into a central PostgreSQL database. Also wrote some sample analytics queries."
    },
    {
      "name": "Core Java Apps",
      "git_url": "/core_java",
      "description": [
        "Twitter App: Developed a CLI app that interacts with Twitter's REST API by forming arguments into HTTP requests. Basic functionality includes posting, deleting, and looking up Tweets. Features dependency injection using Spring framework. Also wrote a number of integration and unit tests using both JUnit and Mockito.",
        "JDBC App: Developed a simple app that can connect to a PostgreSQL database using JDBC. Enables users to perform CRUD operations on the database using the DAO pattern.",
        "Grep App: Wrote a Grep-like Java app that searches for a regex match within all files in a given directory. Results are written to a specified output file. Utilizes Java 8 Stream APIs to read files."
      ]
    },
    {
      "name": "Springboot App",
      "git_url": "/springboot",
      "description": "Developed a SpringBoot application that simulates stock trading using data acquired from a REST API. The application follows a three-tiered microservice architecture, and is built with Spring and Maven providing dependency management. Market data is retrieved from the IEX Cloud REST API and persisted into a PostgreSQL container. Simulated trader accounts and order data are also persisted. JUnit and Mockito were used for integration and unit testing. The application was Dockerized into two separate containers for ease of deployment.  "
    },
    {
      "name": "Hadoop",
      "git_url": "/hadoop",
      "description": "Provisioned a Hadoop cluster on Google Cloud Platform to evaluate data analytics tools and Hadoop's central components. Performed Apache Hive queries on the provided dataset through Zeppelin notebook and evaluated performance differences of storing data in different formats and with partitions. Techniques that were explored in particular included dynamic partitioning of tables, and query performance improvements when using columnar files."
    },
    {
      "name": "Cloud/DevOps",
      "git_url": "/cloud_devops",
      "description": "Deployed Springboot application onto Amazon Web Services. Configured environment to take advantage of AWS features like auto-scaling and automated deployment. Worked with Jenkins to create a CI/CD pipeline to automatically perform builds and deployments."
    },
    {
      "name": "Spark",
      "git_url": "/spark",
      "description": "Evaluated Spark as a big data analytics tool. Provisioned clusters on both Google Cloud and Azure Databricks. Performed analytics on datasets using Spark's Structured APIs and Pyspark."
    },
    {
      "name": "Python Data Analytics",
      "git_url": "/python_data_wrangling",
      "description": "Performed analytics on a sample dataset provided by a web-based retailer to answer crucial business questions. Worked with Pandas DataFrame in a Jupyter notebook."
    }
  ],
  "highlighted_projects": [
    {
      "name": "FlipFlop",
      "git_url": "https://github.com/danny-to7/FlipFlop",
      "description": "Developed a prototype Reddit-like app developed on Android studio. Users can post, comment on posts, and vote. All post and user data was sent to a realtime database running on Google Firebase. Data relevant to the current user was stored locally using SQLite."
    },
    {
      "name": "Wildfire Simulation",
      "git_url": "https://github.com/danny-to7/Simulations",
      "description": "Designed a naive, 2D simulation of wildfire spread programmed in Python and realized using cellular automata. Also implements a 2D cave-generation algorithm to generate a mock forest for testing."
    }
  ],
  "professional_experience": [
    {
      "title": "Software Developer",
      "company": "Jarvis",
      "duration": "2020-present",
      "description": "Developing projects that require the use of different technologies such as PostgreSQL, Java Stream APIs, REST APIs, and Spring framework. Participating in the Scrum to become familiar with development cycles and working in a professional team environment."
    },
    {
      "title": "Software Engineering Intern",
      "company": "Tyco International",
      "duration": "2016-2016",
      "description": "Developed an automated test library using Python and Robot framework. Ran detailed regression testing in accordance with specified parameters, and communicated recurring issues to my team. Also helped train team members in the use of the new test library, and monitored their progress to ensure understanding."
    }
  ],
  "education": [
    {
      "school_name": "Ontario Tech University",
      "duration": "2015-2019",
      "degree": "Bachelor of Science (Hons)",
      "department": "Computer Science",
      "awards_achievements": [
        "GPA: 3.2/4.0"
      ]
    }
  ],
  "others": [
    {
      "title": "Awards",
      "bullets": [
        "Dean's Honours List (2015, 2016)"
      ]
    }
  ]
}
